### Q1. What is the difference between Ordinal Encoding and Label Encoding? Provide an example of when you might choose one over the other.

In [ ]:
label encoding :
    it is just label the data means if we have male and female then we encode this to 0,1.
    likewise it is used when unique value in Feature are samll, and there is no order like male and female 
    we can not encode order things.

ordinal Encoding:
    it is also a encoding method it is similar to the label encoding it is also encode in 0,1,2,3,..
    but the main diff is when we have order in our feature like small,midium,large,extra large do we encode in order like this 
    0,1,2,3,4...
    so small is represent using 0,
    midium is represent using 1,
    large is represent using 2,
    like wise...
    
    both method are same both encode the data, diff is when we have a feature which contain data which have some order 
    some rank then we use ordinal encoding rather than label encoding.

In [1]:
import pandas as pd

In [2]:
df= pd.DataFrame({"gender":["male","female"]})
df

   gender
0    male
1  female

In [3]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [4]:
df["gender"] = encoder.fit_transform(df[["gender"]])

C:\Users\dhruv\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [5]:
df

   gender
0       1
1       0

it take male as 1 and female as 0

In [11]:
from sklearn.preprocessing import OrdinalEncoder
ord = OrdinalEncoder(categories=[["male","female"]])

In [12]:
df= pd.DataFrame({"gender":["male","female"]})
df

   gender
0    male
1  female

In [13]:
df["gender"] = ord.fit_transform(df[["gender"]])

In [14]:
df

   gender
0     0.0
1     1.0

In [ ]:
so now it give female as 0 and male 1

In [ ]:
so when we want to encode data with some specific order we use ordinal encoding other wise we use label encoding.

### Q2. Explain how Target Guided Ordinal Encoding works and provide an example of when you might use it in a machine learning project.

In [15]:
import pandas as pd 
import numpy as np

In [16]:
df = pd.DataFrame({
    "city" :["a1","a2","a3","a4","a1","a3","a3"],
    "cost" : [120,140,130,150,140,200,160]
})
df

  city  cost
0   a1   120
1   a2   140
2   a3   130
3   a4   150
4   a1   140
5   a3   200
6   a3   160

In [21]:
D = df.groupby(["city"]).mean()["cost"].to_dict()

In [24]:
df["city"] = df.city.map(D)

In [25]:
df

         city  cost
0  130.000000   120
1  140.000000   140
2  163.333333   130
3  150.000000   150
4  130.000000   140
5  163.333333   200
6  163.333333   160

### Q3. Define covariance and explain why it is important in statistical analysis. How is covariance calculated?

In [ ]:
Covariance is a measure of the relationship between two random variables and to what extent, they change together.
Or we can say, in other words, it defines the changes between the two variables, such that change in one variable is
equal to change in another variable. This is the property of a function of maintaining its form when the variables are 
linearly transformed.

In [ ]:
two type :
    Positive Covariance
    Negative Covariance

positive covariance :
    it means if we increace the value of x then value of y is also increace.
    and if we decreace the value of x then value of y is also decrease, then we can say this two feature x and y are having
    positive covariance 
    
negative covariance :
    it means if we increace the value of x then value of y is decreace.
    and if we decreace the value of x then value of y is increace, then we can say this two feature x and y are having
    negative covariance.
    
for calculating covarinace we have formula :
    cov(x,y) : sumof((x(i)- x.mean)*(y(i)- y.mean))/n-1     <--- for sample other wise we take N

### Q4. For a dataset with the following categorical variables: Color (red, green, blue), Size (small, medium, large), and Material (wood, metal, plastic), perform label encoding using Python's scikit-learn library. Show your code and explain the output.

In [26]:
data = {
    "color" : ["red","green","blue"],
    "size" : ["small","medium","large"],
    "material" : ["wood","metal","plastic"]
}

In [27]:
import pandas as pd 
df = pd.DataFrame(data)

In [28]:
df

   color    size material
0    red   small     wood
1  green  medium    metal
2   blue   large  plastic

In [29]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [31]:
df["color"] = encoder.fit_transform(df["color"])

In [32]:
df["size"] = encoder.fit_transform(df["size"])
df["material"] = encoder.fit_transform(df["material"])
df

   color  size  material
0      2     2         2
1      1     1         0
2      0     0         1

In [34]:
encoder.get_params()

{}

### Q5. Calculate the covariance matrix for the following variables in a dataset: Age, Income, and Education level. Interpret the results.

In [1]:
import pandas as pd
import numpy as np 
data = {
    "Age" : [20,24,27,29,31,35,39],
    "Income" : [35,48,60,70,75,80,88],
    "Education" : ["Ca","Bca","Civil","It","Ec","ME","Ce"]
}

In [2]:
df = pd.DataFrame(data)

In [4]:
df

   Age  Income Education
0   20      35        Ca
1   24      48       Bca
2   27      60     Civil
3   29      70        It
4   31      75        Ec
5   35      80        ME
6   39      88        Ce

In [5]:
df.cov()

C:\Users\dhruv\AppData\Local\Temp\ipykernel_13564\1545644723.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.cov()

               Age      Income
Age      41.571429  117.452381
Income  117.452381  348.809524

In [6]:
df.corr(method="spearman")

C:\Users\dhruv\AppData\Local\Temp\ipykernel_13564\3994303778.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr(method="spearman")

        Age  Income
Age     1.0     1.0
Income  1.0     1.0

In [7]:
df.corr(method="pearson")

C:\Users\dhruv\AppData\Local\Temp\ipykernel_13564\2677068142.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr(method="pearson")

             Age    Income
Age     1.000000  0.975372
Income  0.975372  1.000000

In [8]:
## here we created data which is linearly corelated with each other.
## so we can see both feature are highly corealted with each other

### Q6. You are working on a machine learning project with a dataset containing several categorical variables, including "Gender" (Male/Female), "Education Level" (High School/Bachelor's/Master's/PhD), and "Employment Status" (Unemployed/Part-Time/Full-Time). Which encoding method would you use for each variable, and why?

In [9]:
data = {
    "Gender" : ["male","female","male","female","female"],
    "Education level" : ["Bachlore's in computer", "MBA in finance", "Master's in data science" , "High school","PHD"],
    "Employment-status" : ["full-time","part-time","unemployed","unemployed","full-time"]
}

In [10]:
df = pd.DataFrame(data)
df

   Gender           Education level Employment-status
0    male    Bachlore's in computer         full-time
1  female            MBA in finance         part-time
2    male  Master's in data science        unemployed
3  female               High school        unemployed
4  female                       PHD         full-time

In [11]:
df["Gender"].uniqueque()

array(['male', 'female'], dtype=object)

In [12]:
df["Education level"].unique()

array(["Bachlore's in computer", 'MBA in finance',
       "Master's in data science", 'High school', 'PHD'], dtype=object)

In [13]:
df["Employment-status"].uniqueque()

array(['full-time', 'part-time', 'unemployed'], dtype=object)

In [14]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [15]:
df["Gender"] = encoder.fit_transform(df["Gender"])
df.head(3)

   Gender           Education level Employment-status
0       1    Bachlore's in computer         full-time
1       0            MBA in finance         part-time
2       1  Master's in data science        unemployed

In [16]:
from sklearn.preprocessing import OneHotEncoder
one = OneHotEncoder()

In [19]:
df.head(3)

   Gender           Education level Employment-status
0       1    Bachlore's in computer         full-time
1       0            MBA in finance         part-time
2       1  Master's in data science        unemployed

In [20]:
x = one.fit_transform(df[["Education level"]])

<5x5 sparse matrix of type '<class 'numpy.float64'>'
	with 5 stored elements in Compressed Sparse Row format>

In [21]:
x = x.toarray()
x

array([[1., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1.]])

In [23]:
one.get_feature_names_out()

array(["Education level_Bachlore's in computer",
       'Education level_High school', 'Education level_MBA in finance',
       "Education level_Master's in data science", 'Education level_PHD'],
      dtype=object)

In [24]:
df2 = pd.DataFrame(x,columns=one.get_feature_names_out())
df2

,Education level_Bachlore's in computer,Education level_High school,Education level_MBA in finance,Education level_Master's in data science,Education level_PHD
0,1.0,0.0,0.0,0.0,0.0
1,0.0,0.0,1.0,0.0,0.0
2,0.0,0.0,0.0,1.0,0.0
3,0.0,1.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,1.0

In [26]:
x1 = one.fit_transform(df[["Employment-status"]])

In [27]:
df3 = pd.DataFrame(x1.toarray(),columns= one.get_feature_names_out())
df3

,Employment-status_full-time,Employment-status_part-time,Employment-status_unemployed
0,1.0,0.0,0.0
1,0.0,1.0,0.0
2,0.0,0.0,1.0
3,0.0,0.0,1.0
4,1.0,0.0,0.0

In [29]:
df1 = pd.concat([df,df2,df3],axis=1)

In [30]:
df1.head()

,Gender,Education level,Employment-status,Education level_Bachlore's in computer,Education level_High school,Education level_MBA in finance,Education level_Master's in data science,Education level_PHD,Employment-status_full-time,Employment-status_part-time,Employment-status_unemployed
0,1,Bachlore's in computer,full-time,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,0,MBA in finance,part-time,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
2,1,Master's in data science,unemployed,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0
3,0,High school,unemployed,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0
4,0,PHD,full-time,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0

In [31]:
df1.drop(["Education level","Employment-status"],axis=1,inplace=True)

In [32]:
df1.head()

,Gender,Education level_Bachlore's in computer,Education level_High school,Education level_MBA in finance,Education level_Master's in data science,Education level_PHD,Employment-status_full-time,Employment-status_part-time,Employment-status_unemployed
0,1,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,0,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
2,1,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0
3,0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0
4,0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0

In [ ]:
## we can see we completly convert each feature to numeric by using one hot encoding and label encoding.
## in gender feature i use label emcoder because that feature only have two category male or feamle
## for remaining two i use one hot encoding because they have more then two category and we dont have lots of 
## feature so to create new feature is not an issue.

# Q7. You are analyzing a dataset with two continuous variables, "Temperature" and "Humidity", and two categorical variables, "Weather Condition" (Sunny/Cloudy/Rainy) and "Wind Direction" (North/South/East/West). Calculate the covariance between each pair of variables and interpret the results.

In [47]:
np.random.seed(51)
data = {
    "Temperature" : np.random.randint(20,45,6),
    "Humidity" : np.random.randint(60,100,6),
    "Weather Condition" : ["sunny","cloudy","rainy","sunny","rainy","cloudy"],
    "Wind direction" : ["North","South","East","West","North","West"]
}

In [48]:
df = pd.DataFrame(data)
df

   Temperature  Humidity Weather Condition Wind direction
0           25        90             sunny          North
1           20        97            cloudy          South
2           29        97             rainy           East
3           25        90             sunny           West
4           36        88             rainy          North
5           41        80            cloudy           West

In [49]:
df.cov()

C:\Users\dhruv\AppData\Local\Temp\ipykernel_13564\1545644723.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.cov()

             Temperature   Humidity
Temperature    61.066667 -39.533333
Humidity      -39.533333  40.266667

In [52]:
df["Temperature"].cov(df["Humidity"])

-39.53333333333333

### first we have to encode category features to numerical feature

In [54]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [55]:
df["Wind direction"] = encoder.fit_transform(df[["Wind direction"]])
df["Weather Condition"] = encoder.fit_transform(df[["Weather Condition"]])
df.head(5)

C:\Users\dhruv\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\dhruv\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

   Temperature  Humidity  Weather Condition  Wind direction
0           25        90                  2               1
1           20        97                  0               2
2           29        97                  1               0
3           25        90                  2               3
4           36        88                  1               1

In [58]:
for i in range(len(df.columns)):
    for j in range(i+1,len(df.columns)):
        print(f"covariance between {df.columns[i]} and {df.columns[j]} is, {df[df.columns[i]].cov(df[df.columns[j]])}")

covariance between Temperature and Humidity is, -39.53333333333333
covariance between Temperature and Weather Condition is, -2.2
covariance between Temperature and Wind direction is, 1.1333333333333335
covariance between Humidity and Weather Condition is, 0.6000000000000001
covariance between Humidity and Wind direction is, -4.266666666666667
covariance between Weather Condition and Wind direction is, -0.2

In [62]:
for i in range(len(df.columns)):
    for j in range(i+1,len(df.columns)):
        print(f"pearson corelation coeffiecent between columns {df.columns[i]} and {df.columns[j]} is: {df[df.columns[i]].corr(df[df.columns[j]])}")

pearson corelation coeffiecent between columns Temperature and Humidity is: -0.7972389109556389
pearson corelation coeffiecent between columns Temperature and Weather Condition is: -0.3147571324080628
pearson corelation coeffiecent between columns Temperature and Wind direction is: 0.11975394914841651
pearson corelation coeffiecent between columns Humidity and Weather Condition is: 0.10571422179036141
pearson corelation coeffiecent between columns Humidity and Wind direction is: -0.5552009035902058
pearson corelation coeffiecent between columns Weather Condition and Wind direction is: -0.1846372364689991